weifengdq/embedded/tc364/0_Empty_Project/Libraries/Infra/Sfr/TC36x/IfxCan_regdef.h
/** \brief TT Trigger Memory Configuration ${i} */
typedef struct _Ifx_CAN_N_TT_TMC_Bits
{
    Ifx_UReg_32Bit reserved_0:2;      /**< \brief [1:0] \internal Reserved */
    Ifx_UReg_32Bit TMSA:14;           /**< \brief [15:2] Trigger Memory Start Address - TMSA (rw) */
    Ifx_UReg_32Bit TME:7;             /**< \brief [22:16] Trigger Memory Elements - TME (rw) */
    Ifx_UReg_32Bit reserved_23:9;     /**< \brief [31:23] \internal Reserved */
} Ifx_CAN_N_TT_TMC_Bits;

/** \brief TT Time Mark ${i} */
typedef struct _Ifx_CAN_N_TT_TMK_Bits
{
    Ifx_UReg_32Bit TM:16;             /**< \brief [15:0] Time Mark - TM (rw) */
    Ifx_UReg_32Bit TICC:7;            /**< \brief [22:16] Time Mark Cycle Code - TICC (rw) */
    Ifx_UReg_32Bit reserved_23:8;     /**< \brief [30:23] \internal Reserved */
    Ifx_UReg_32Bit LCKM:1;            /**< \brief [31:31] TT Time Mark Register Locked - LCKM (rh) */
} Ifx_CAN_N_TT_TMK_Bits;

/** \brief TUR Configuration ${i} */
typedef struct _Ifx_CAN_N_TT_TURCF_Bits
{
    Ifx_UReg_32Bit NCL:16;            /**< \brief [15:0] Numerator Configuration Low - NCL (rw) */
    Ifx_UReg_32Bit DC:14;             /**< \brief [29:16] Denominator Configuration - DC (rw) */
    Ifx_UReg_32Bit reserved_30:1;     /**< \brief [30:30] \internal Reserved */
    Ifx_UReg_32Bit ELT:1;             /**< \brief [31:31] Enable Local Time - ELT (rw) */
} Ifx_CAN_N_TT_TURCF_Bits;

/** \brief TUR Numerator Actual ${i} */
typedef struct _Ifx_CAN_N_TT_TURNA_Bits
{
    Ifx_UReg_32Bit NAV:18;            /**< \brief [17:0] Numerator Actual Value - NAV (rh) */
    Ifx_UReg_32Bit reserved_18:14;    /**< \brief [31:18] \internal Reserved */
} Ifx_CAN_N_TT_TURNA_Bits;

/** \brief Tx Buffer Add Request ${i} */
typedef struct _Ifx_CAN_N_TX_BAR_Bits
{
    Ifx_UReg_32Bit AR0:1;             /**< \brief [0:0] Add Request Tx Buffer 0 - AR (rwh) */
    Ifx_UReg_32Bit AR1:1;             /**< \brief [1:1] Add Request Tx Buffer 1 - AR (rwh) */
    Ifx_UReg_32Bit AR2:1;             /**< \brief [2:2] Add Request Tx Buffer 2 - AR (rwh) */
    Ifx_UReg_32Bit AR3:1;             /**< \brief [3:3] Add Request Tx Buffer 3 - AR (rwh) */
    Ifx_UReg_32Bit AR4:1;             /**< \brief [4:4] Add Request Tx Buffer 4 - AR (rwh) */
    Ifx_UReg_32Bit AR5:1;             /**< \brief [5:5] Add Request Tx Buffer 5 - AR (rwh) */
    Ifx_UReg_32Bit AR6:1;             /**< \brief [6:6] Add Request Tx Buffer 6 - AR (rwh) */
    Ifx_UReg_32Bit AR7:1;             /**< \brief [7:7] Add Request Tx Buffer 7 - AR (rwh) */
    Ifx_UReg_32Bit AR8:1;             /**< \brief [8:8] Add Request Tx Buffer 8 - AR (rwh) */
    Ifx_UReg_32Bit AR9:1;             /**< \brief [9:9] Add Request Tx Buffer 9 - AR (rwh) */
    Ifx_UReg_32Bit AR10:1;            /**< \brief [10:10] Add Request Tx Buffer 10 - AR (rwh) */
    Ifx_UReg_32Bit AR11:1;            /**< \brief [11:11] Add Request Tx Buffer 11 - AR (rwh) */
    Ifx_UReg_32Bit AR12:1;            /**< \brief [12:12] Add Request Tx Buffer 12 - AR (rwh) */
    Ifx_UReg_32Bit AR13:1;            /**< \brief [13:13] Add Request Tx Buffer 13 - AR (rwh) */
    Ifx_UReg_32Bit AR14:1;            /**< \brief [14:14] Add Request Tx Buffer 14 - AR (rwh) */
    Ifx_UReg_32Bit AR15:1;            /**< \brief [15:15] Add Request Tx Buffer 15 - AR (rwh) */
    Ifx_UReg_32Bit AR16:1;            /**< \brief [16:16] Add Request Tx Buffer 16 - AR (rwh) */
    Ifx_UReg_32Bit AR17:1;            /**< \brief [17:17] Add Request Tx Buffer 17 - AR (rwh) */
    Ifx_UReg_32Bit AR18:1;            /**< \brief [18:18] Add Request Tx Buffer 18 - AR (rwh) */
    Ifx_UReg_32Bit AR19:1;            /**< \brief [19:19] Add Request Tx Buffer 19 - AR (rwh) */
    Ifx_UReg_32Bit AR20:1;            /**< \brief [20:20] Add Request Tx Buffer 20 - AR (rwh) */
    Ifx_UReg_32Bit AR21:1;            /**< \brief [21:21] Add Request Tx Buffer 21 - AR (rwh) */
    Ifx_UReg_32Bit AR22:1;            /**< \brief [22:22] Add Request Tx Buffer 22 - AR (rwh) */
    Ifx_UReg_32Bit AR23:1;            /**< \brief [23:23] Add Request Tx Buffer 23 - AR (rwh) */
    Ifx_UReg_32Bit AR24:1;            /**< \brief [24:24] Add Request Tx Buffer 24 - AR (rwh) */
    Ifx_UReg_32Bit AR25:1;            /**< \brief [25:25] Add Request Tx Buffer 25 - AR (rwh) */
    Ifx_UReg_32Bit AR26:1;            /**< \brief [26:26] Add Request Tx Buffer 26 - AR (rwh) */
    Ifx_UReg_32Bit AR27:1;            /**< \brief [27:27] Add Request Tx Buffer 27 - AR (rwh) */
    Ifx_UReg_32Bit AR28:1;            /**< \brief [28:28] Add Request Tx Buffer 28 - AR (rwh) */
    Ifx_UReg_32Bit AR29:1;            /**< \brief [29:29] Add Request Tx Buffer 29 - AR (rwh) */
    Ifx_UReg_32Bit AR30:1;            /**< \brief [30:30] Add Request Tx Buffer 30 - AR (rwh) */
    Ifx_UReg_32Bit AR31:1;            /**< \brief [31:31] Add Request Tx Buffer 31 - AR (rwh) */
} Ifx_CAN_N_TX_BAR_Bits;

/** \brief Tx Buffer Configuration ${i} */
typedef struct _Ifx_CAN_N_TX_BC_Bits
{
    Ifx_UReg_32Bit reserved_0:2;      /**< \brief [1:0] \internal Reserved */
    Ifx_UReg_32Bit TBSA:14;           /**< \brief [15:2] Tx Buffers Start Address - TBSA (rw) */
    Ifx_UReg_32Bit NDTB:6;            /**< \brief [21:16] Number of Dedicated Transmit Buffers - NDTB (rw) */
    Ifx_UReg_32Bit reserved_22:2;     /**< \brief [23:22] \internal Reserved */
    Ifx_UReg_32Bit TFQS:6;            /**< \brief [29:24] Transmit FIFO/Queue Size - TFQS (rw) */
    Ifx_UReg_32Bit TFQM:1;            /**< \brief [30:30] Tx FIFO/Queue Mode - TFQM (rw) */
    Ifx_UReg_32Bit reserved_31:1;     /**< \brief [31:31] \internal Reserved */
} Ifx_CAN_N_TX_BC_Bits;

/** \brief Tx Buffer Cancellation Finished ${i} */
typedef struct _Ifx_CAN_N_TX_BCF_Bits
{
    Ifx_UReg_32Bit CF0:1;             /**< \brief [0:0] Cancellation Finished Tx Buffer 0 - CF (rh) */
    Ifx_UReg_32Bit CF1:1;             /**< \brief [1:1] Cancellation Finished Tx Buffer 1 - CF (rh) */
    Ifx_UReg_32Bit CF2:1;             /**< \brief [2:2] Cancellation Finished Tx Buffer 2 - CF (rh) */
    Ifx_UReg_32Bit CF3:1;             /**< \brief [3:3] Cancellation Finished Tx Buffer 3 - CF (rh) */
    Ifx_UReg_32Bit CF4:1;             /**< \brief [4:4] Cancellation Finished Tx Buffer 4 - CF (rh) */
    Ifx_UReg_32Bit CF5:1;             /**< \brief [5:5] Cancellation Finished Tx Buffer 5 - CF (rh) */
    Ifx_UReg_32Bit CF6:1;             /**< \brief [6:6] Cancellation Finished Tx Buffer 6 - CF (rh) */
    Ifx_UReg_32Bit CF7:1;             /**< \brief [7:7] Cancellation Finished Tx Buffer 7 - CF (rh) */
    Ifx_UReg_32Bit CF8:1;             /**< \brief [8:8] Cancellation Finished Tx Buffer 8 - CF (rh) */
    Ifx_UReg_32Bit CF9:1;             /**< \brief [9:9] Cancellation Finished Tx Buffer 9 - CF (rh) */
    Ifx_UReg_32Bit CF10:1;            /**< \brief [10:10] Cancellation Finished Tx Buffer 10 - CF (rh) */
    Ifx_UReg_32Bit CF11:1;            /**< \brief [11:11] Cancellation Finished Tx Buffer 11 - CF (rh) */
    Ifx_UReg_32Bit CF12:1;            /**< \brief [12:12] Cancellation Finished Tx Buffer 12 - CF (rh) */
    Ifx_UReg_32Bit CF13:1;            /**< \brief [13:13] Cancellation Finished Tx Buffer 13 - CF (rh) */
    Ifx_UReg_32Bit CF14:1;            /**< \brief [14:14] Cancellation Finished Tx Buffer 14 - CF (rh) */
    Ifx_UReg_32Bit CF15:1;            /**< \brief [15:15] Cancellation Finished Tx Buffer 15 - CF (rh) */
    Ifx_UReg_32Bit CF16:1;            /**< \brief [16:16] Cancellation Finished Tx Buffer 16 - CF (rh) */
    Ifx_UReg_32Bit CF17:1;            /**< \brief [17:17] Cancellation Finished Tx Buffer 17 - CF (rh) */
    Ifx_UReg_32Bit CF18:1;            /**< \brief [18:18] Cancellation Finished Tx Buffer 18 - CF (rh) */
    Ifx_UReg_32Bit CF19:1;            /**< \brief [19:19] Cancellation Finished Tx Buffer 19 - CF (rh) */
    Ifx_UReg_32Bit CF20:1;            /**< \brief [20:20] Cancellation Finished Tx Buffer 20 - CF (rh) */
    Ifx_UReg_32Bit CF21:1;            /**< \brief [21:21] Cancellation Finished Tx Buffer 21 - CF (rh) */
    Ifx_UReg_32Bit CF22:1;            /**< \brief [22:22] Cancellation Finished Tx Buffer 22 - CF (rh) */
    Ifx_UReg_32Bit CF23:1;            /**< \brief [23:23] Cancellation Finished Tx Buffer 23 - CF (rh) */
    Ifx_UReg_32Bit CF24:1;            /**< \brief [24:24] Cancellation Finished Tx Buffer 24 - CF (rh) */
    Ifx_UReg_32Bit CF25:1;            /**< \brief [25:25] Cancellation Finished Tx Buffer 25 - CF (rh) */
    Ifx_UReg_32Bit CF26:1;            /**< \brief [26:26] Cancellation Finished Tx Buffer 26 - CF (rh) */
    Ifx_UReg_32Bit CF27:1;            /**< \brief [27:27] Cancellation Finished Tx Buffer 27 - CF (rh) */
    Ifx_UReg_32Bit CF28:1;            /**< \brief [28:28] Cancellation Finished Tx Buffer 28 - CF (rh) */
    Ifx_UReg_32Bit CF29:1;            /**< \brief [29:29] Cancellation Finished Tx Buffer 29 - CF (rh) */
    Ifx_UReg_32Bit CF30:1;            /**< \brief [30:30] Cancellation Finished Tx Buffer 30 - CF (rh) */
    Ifx_UReg_32Bit CF31:1;            /**< \brief [31:31] Cancellation Finished Tx Buffer 31 - CF (rh) */
} Ifx_CAN_N_TX_BCF_Bits;

/** \brief Tx Buffer Cancellation Finished Interrupt Enable ${i} */
typedef struct _Ifx_CAN_N_TX_BCIE_Bits
{
    Ifx_UReg_32Bit CFIE0:1;           /**< \brief [0:0] Cancellation Finished Interrupt Enable Tx Buffer 0 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE1:1;           /**< \brief [1:1] Cancellation Finished Interrupt Enable Tx Buffer 1 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE2:1;           /**< \brief [2:2] Cancellation Finished Interrupt Enable Tx Buffer 2 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE3:1;           /**< \brief [3:3] Cancellation Finished Interrupt Enable Tx Buffer 3 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE4:1;           /**< \brief [4:4] Cancellation Finished Interrupt Enable Tx Buffer 4 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE5:1;           /**< \brief [5:5] Cancellation Finished Interrupt Enable Tx Buffer 5 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE6:1;           /**< \brief [6:6] Cancellation Finished Interrupt Enable Tx Buffer 6 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE7:1;           /**< \brief [7:7] Cancellation Finished Interrupt Enable Tx Buffer 7 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE8:1;           /**< \brief [8:8] Cancellation Finished Interrupt Enable Tx Buffer 8 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE9:1;           /**< \brief [9:9] Cancellation Finished Interrupt Enable Tx Buffer 9 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE10:1;          /**< \brief [10:10] Cancellation Finished Interrupt Enable Tx Buffer 10 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE11:1;          /**< \brief [11:11] Cancellation Finished Interrupt Enable Tx Buffer 11 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE12:1;          /**< \brief [12:12] Cancellation Finished Interrupt Enable Tx Buffer 12 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE13:1;          /**< \brief [13:13] Cancellation Finished Interrupt Enable Tx Buffer 13 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE14:1;          /**< \brief [14:14] Cancellation Finished Interrupt Enable Tx Buffer 14 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE15:1;          /**< \brief [15:15] Cancellation Finished Interrupt Enable Tx Buffer 15 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE16:1;          /**< \brief [16:16] Cancellation Finished Interrupt Enable Tx Buffer 16 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE17:1;          /**< \brief [17:17] Cancellation Finished Interrupt Enable Tx Buffer 17 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE18:1;          /**< \brief [18:18] Cancellation Finished Interrupt Enable Tx Buffer 18 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE19:1;          /**< \brief [19:19] Cancellation Finished Interrupt Enable Tx Buffer 19 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE20:1;          /**< \brief [20:20] Cancellation Finished Interrupt Enable Tx Buffer 20 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE21:1;          /**< \brief [21:21] Cancellation Finished Interrupt Enable Tx Buffer 21 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE22:1;          /**< \brief [22:22] Cancellation Finished Interrupt Enable Tx Buffer 22 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE23:1;          /**< \brief [23:23] Cancellation Finished Interrupt Enable Tx Buffer 23 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE24:1;          /**< \brief [24:24] Cancellation Finished Interrupt Enable Tx Buffer 24 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE25:1;          /**< \brief [25:25] Cancellation Finished Interrupt Enable Tx Buffer 25 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE26:1;          /**< \brief [26:26] Cancellation Finished Interrupt Enable Tx Buffer 26 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE27:1;          /**< \brief [27:27] Cancellation Finished Interrupt Enable Tx Buffer 27 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE28:1;          /**< \brief [28:28] Cancellation Finished Interrupt Enable Tx Buffer 28 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE29:1;          /**< \brief [29:29] Cancellation Finished Interrupt Enable Tx Buffer 29 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE30:1;          /**< \brief [30:30] Cancellation Finished Interrupt Enable Tx Buffer 30 - CFIE (rw) */
    Ifx_UReg_32Bit CFIE31:1;          /**< \brief [31:31] Cancellation Finished Interrupt Enable Tx Buffer 31 - CFIE (rw) */
} Ifx_CAN_N_TX_BCIE_Bits;

